module.exports.config = {
 name: "birthday",
 version: "1.0.0",
 hasPermssion: 2,
 credits: "Shahadat SAHU",
 description: "মেনশন করলে শুভেচ্ছা জানাবে",
 commandCategory: "group",
 usages: "[@মেনশন]",
 cooldowns: 5,
 dependencies: {
 "fs-extra": "",
 "axios": ""
 }
};

module.exports.run = async function ({ api, event, args }) {
 try {
 if (Object.keys(event.mentions).length === 0) {
 return api.sendMessage("আপনি কাকে শুভেচ্ছা জানাতে চান এমন একজন কে মেনশন করুন!😘", event.threadID);
 }

 const mention = Object.keys(event.mentions)[0];
 const name = event.mentions[mention].replace("@", "");
 const arraytag = [{ id: mention, tag: name }];

 const sendMessage = (msg) => {
 api.sendMessage({ body: msg, mentions: arraytag }, event.threadID);
 };

 
 sendMessage(`ব্ঁ'স্ঁ মে্ঁ'হে্ঁ'দী্ঁ'র্ঁ প্ঁ'ক্ষ্ঁ থে্ঁ'কে্ঁ তো্ঁ'মা্ঁ'কে্ঁ জা্ঁ'না্ঁ'ই্ঁ জ্ঁ'ন্ম্ঁ'দি্ঁ'নে্ঁ'র্ঁ শু্ঁ'ভে্ঁ'চ্ছা্ঁ, @${name}!\n🎉𝐇𝐚𝐩𝐩𝐲 𝐁𝐢𝐫𝐭𝐡𝐝𝐚𝐲..!!🎂💚🎉`);
 const messages = [
 { delay: 3000, msg: `জী্ঁ'ব্ঁ'ন্ঁ থে্ঁ'কে্ঁ আ্ঁ'রো্ঁ এ্ঁ'ক্ঁ'টি্ঁ ব্ঁ'ছ্ঁ'র্ঁ চ্ঁ'লে্ঁ গে্ঁ'লো্ঁ.। সু্ঁ'স্থ্ঁ থা্ঁ'কো্ঁ, ভা্ঁ'লো্ঁ থা্ঁ'কো্ঁ এ্ঁ'ই্ঁ কা্ঁ'ম্ঁ'না্ঁ'ই্ঁ ক্ঁ'রি্ঁ বা্ঁ'র বা্ঁ'র্ঁ!\n🥰শু্ঁ'ভ্ঁ জ্ঁ'ন্ম্ঁ'দি্ঁ'ন্ঁ🥰 @${name}` },
 { delay: 6000, msg: `ღসু্ঁ'ন্দ্ঁ'র্ঁ!!এ্ঁ'ই্ঁ!!ভূ্ঁ'ব্ঁ'নে্ঁ!সু্ঁ'ন্দ্ঁ'র্ঁ'ত্ঁ'ম্ঁ!!জী্ঁ'ব্ঁ'ন্ঁ!!হো্ঁ'ক্ঁ! আ্ঁ'প্ঁ'না্ঁ'র্ঁ !!😻🥰
ღপূ্ঁ'র্ঁ'ন্ঁ!হো্ঁ'ক্ঁ!প্র্ঁ'তি্ঁ'টি্ঁ!স্ব্ঁ'প্ন্ঁ!প্র্ঁ'তি্ঁ'টি্ঁ!আ্ঁ'শা্ঁ!বে্ঁ'চে্ঁ! থা্ঁ'কে্ঁ'ন্ঁ!হা্ঁ'জা্ঁ'র্ঁ!ব্ঁ'ছ্ঁ'র্ঁ!!🍃🌻
_আ্ঁ'জ্ঁ'কে্ঁ'র্ঁ এ্ঁ'ই্ঁ দি্ঁ'নে্ঁ স্ঁ'ব্ঁ'কি্ঁ'ছু্ঁ হ্ঁ'উ্ঁ'ক্ঁ ন্ঁ'তু্ঁ'ন্ঁ ক্ঁ'রে্ঁ!
-সু্ঁ'খে্ঁ'র্ঁ স্মৃ্ঁ'তি্ঁ টু্ঁ'কু্ঁ থা্ঁ'ক্ঁ কা্ঁ'ছে্ঁ!
দু্ঁঃ'খ্ঁ গু্ঁ'লা্ঁ যা্ঁ'ক্ঁ দূ্ঁ'রে্ঁ'!🌼

-প্র্ঁ'ত্যা্ঁ'শা্ঁ ক্ঁ'রি্ঁ জী্ঁ'ব্ঁ'নে্ঁ'র্ঁ প্র্ঁ'তি্ঁ'টা্ঁ কা্ঁ'জে্ঁ স্ঁ'ফ্ঁ'ল্ঁ হ্ঁ'ন্ঁ..!!🌻🖤!\n🥰শু্ঁ'ভ্ঁ জ্ঁ'ন্ম্ঁ'দি্ঁ'ন্ঁ😍 @${name}` },
 { delay: 10000, msg: `জ্ঁ'ন্ম্ঁ'দি্ঁ'নে্ঁ শু্ঁ'ভে্ঁ'চ্ছা্ঁ নি্ঁ'ও প্রি্ঁ'ও~!\n🌼শু্ঁ'ভ্ঁ জ্ঁ'ন্ম্ঁ'দি্ঁ'ন্ঁ🌼 @${name}` },
 { delay: 14000, msg: `আ্ঁ'জ্ঁ জ্ঁ'ন্ম্ঁ'দি্ঁ'নে্ঁ আ্ঁ'ন্ঁ'ন্দ্ঁ ও সু্ঁ'ন্দ্ঁ'র্ঁ মু্ঁ'হু্ঁ'র্তে্ঁ ভ্ঁ'রে্ঁ উ্ঁ'ঠু্ঁ'ক্ঁ এ্ঁ'ই্ঁ কা্ঁ'ম্ঁ'না্ঁ'ই্ঁ ক্ঁ'রি্ঁ..!!—♡ღ-শু্ঁ'ভ্ঁ༎༅জ্ঁ'ন্ম্ঁ'দি্ঁ'ন্ঁ༎༊♡🙂🌻 @${name}` },
 { delay: 18000, msg: `ফু্ঁ'লে্ঁ'র্ঁ হা্ঁ'সি্ঁ'তে্ঁ প্রা্ঁ'ণে্ঁ'র্ঁ খু্ঁ'শি্ঁ'তে্ঁ, অ্ঁ'লি্ঁ'রা্ঁ গা্ঁ'নে্ঁ গা্ঁ'নে্ঁ ফু্ঁ'লে্ঁ'র কা্ঁ'নে্ঁ কা্ঁ'নে্ঁ, ব্ঁ'ল্ঁ'ছে্ঁ আ্ঁ'জ্ঁ সে্ঁ'ই্ঁ শু্ঁ'ভ্ঁ দি্ঁ'ন্ঁ..!!\n—♡ღ-শু্ঁ'ভ্ঁ༎༅জ্ঁ'ন্ম্ঁ'দি্ঁ'ন্ঁ༎༊♡🙂🌻 @${name}` },
 { delay: 26000, msg: `শু্ঁ'ভ্ঁ হো্ঁ'ক্ঁ তো্ঁ'মা্ঁ'র্ঁ আ্ঁ'গা্ঁ'মী্ঁ দি্ঁ'ন্ঁ...!!💖\n—♡ღ-শু্ঁ'ভ্ঁ༎༅জ্ঁ'ন্ম্ঁ'দি্ঁ'ন্ঁ༎༊♡🙂@${name}` },
 { delay: 30000, msg: `জ্ঁ'ন্ম্ঁ'দি্ঁ'নে্ঁ'র্ঁ শু্ঁ'ভে্ঁ'চ্ছা্ঁ নি্ঁ'ও প্রি্ঁ'য়্ঁ..!! @${name}!🎂\nতো্ঁ'মা্ঁ'র্ঁ প্ঁ'থ্ঁ চ্ঁ'লা্ঁ হো্ঁ'ক্ঁ আ্ঁ'ন্ঁ'ন্দে্ঁ'র্ঁ, ভা্ঁ'লো্ঁ'বা্ঁ'সা্ঁ'র্ঁ ও সা্ঁ'ফ্ঁ'ল্যে্ঁ'র্ঁ..!।` },
 { delay: 34000, msg: `-𝐌𝐚𝐧𝐲 𝐌𝐚𝐧𝐲 𝐇𝐚𝐩𝐩𝐲 𝐑𝐞𝐭𝐮𝐫𝐧𝐬 𝐎𝐟 𝐓𝐡𝐞 𝐃𝐚𝐲.!🥰♥️\n -𝐇𝐚𝐩𝐩𝐲 𝐁𝐢𝐫𝐭𝐡𝐝𝐚𝐲..!!🎂💚💜 @${name}` },
 { delay: 38000, msg: `ম্ঁ'ন্ঁ থে্ঁ'কে্ঁ দো্ঁ'য়া্ঁ ক্ঁ'রি্ঁ স্ঁ'ব‌্ঁ স্ঁ'ম্ঁ'য়্ঁ সু্ঁ'খে্ঁ থা্ঁ'কো্ঁ ভা্ঁ'লো্ঁ থা্ঁ'কো্ঁ...!!🥰 \n—♡ღ-শু্ঁ'ভ্ঁ༎༅জ্ঁ'ন্ম্ঁ'দি্ঁ'ন্ঁ༎༊♡🙂🌻 @${name}!` },
 { delay: 42000, msg: `স্ঁ'ব্ঁ'শে্ঁ'ষে্ঁ এ্ঁ'ক্ঁ'টা্ঁ'ই্ঁ প্র্ঁ'ত্যা্ঁ'শা্ঁ স্ঁ'ব্ঁ'স্ঁ'ম্ঁ'য়্ঁ মা্ঁ বা্ঁ'বা্ঁ'র ক্ঁ'থা্ঁ শু্ঁ'নে্ঁ চ্ঁ'ল্ঁ'বা্ঁ..!মা্ঁ বা্ঁ'বা্ঁ'র্ঁ য্ঁ'ত্ন্ঁ নি্ঁ'বা্ঁ..! পা্ঁ'চ্ঁ ও্ঁ'য়া্ঁ'ক্ত্ঁ না্ঁ'মা্ঁ'জ্ঁ প্ঁ'ড়্ঁ'বা্ঁ..!🥰😘 @${name}` }
 ];

 messages.forEach(({delay, msg}) => {
 setTimeout(() => sendMessage(msg), delay);
 });

 } catch (error) {
 console.error(error);
 api.sendMessage("বার্তা পাঠাতে সমস্যা হয়েছে!\nদয়া করে আবার চেষ্টা করুন!", event.threadID);
 }
};
